app/views/posts/index.html.erb

        <div class="post_view"><%= post.description %></div>
        <div><%= post.username %> - <%= post.created_at.strftime("%m/%d/%Y - %H:%M") %></div>
---
INSERT INTO "posts" ("created_at", "description", "discuss_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 18 Sep 2013 16:49:55 UTC +00:00], ["description", "afsa"], ["discuss_id", 1], ["title", "adfa"], ["updated_at", Wed, 18 Sep 2013 16:49:55 UTC +00:00]]