app/controllers/discusses_controller.rb

  def create
    @discuss = @topic.discusses.new(discuss_params)
    @discuss.user = @user

    respond_to do |format|
      if @discuss.save
---
INSERT INTO "discusses" ("created_at", "description", "title", "topic_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 23 Sep 2013 17:30:39 UTC +00:00], ["description", "sdf"], ["title", "sfds"], ["topic_id", 14], ["updated_at", Mon, 23 Sep 2013 17:30:39 UTC +00:00], ["username", "maburkle"]]

  def destroy
    @discuss.destroy
---
DELETE FROM "discusses" WHERE "discusses"."id" = ?  [["id", 10]]

    def set_discuss
      @discuss = @topic.discusses.friendly.find(params[:id])
---
SELECT "discusses".* FROM "discusses" WHERE "discusses"."topic_id" = ? AND "discusses"."id" = ? LIMIT 1  [["topic_id", 14], ["id", "10"]]