app/controllers/forums_controller.rb

SELECT "forums".* FROM "forums"
---
  def index
    @forums = Forum.all

INSERT INTO "forums" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 17 Sep 2013 13:11:16 UTC +00:00], ["description", "The OG of MMOs"], ["title", "World of Warcraft"], ["updated_at", Tue, 17 Sep 2013 13:11:16 UTC +00:00]]
---
  def create
    @forum = Forum.new(forum_params)
    @forum.username = current_user.username

    respond_to do |format|
      if @forum.save

UPDATE "forums" SET "title" = ?, "updated_at" = ? WHERE "forums"."id" = 1  [["title", "FF XIVs"], ["updated_at", Thu, 19 Sep 2013 12:41:00 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @forum.update(forum_params)

DELETE FROM "forums" WHERE "forums"."id" = ?  [["id", 2]]
---
  def destroy
    @forum.destroy

SELECT "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT 1  [["id", "2"]]
---
    def set_forum
      @forum = Forum.find(params[:id])