app/controllers/posts_controller.rb

  def create
    @post = @discuss.posts.new(post_params)
    @post.user = @user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "description", "discuss_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 23 Sep 2013 17:35:54 UTC +00:00], ["description", "this is a post"], ["discuss_id", 9], ["updated_at", Mon, 23 Sep 2013 17:35:54 UTC +00:00], ["username", "maburkle"]]

  def destroy
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 21]]

  def set_newest
    @newest = Discuss.friendly.find(:all, order: "updated_at", limit: 5).reverse
---
SELECT "discusses".* FROM "discusses" WHERE "discusses"."id" = ? ORDER BY "discusses"."id" ASC LIMIT 1  [["id", 9]]

    def set_post
      @post = @discuss.posts.friendly.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."discuss_id" = ? AND "posts"."id" = ? LIMIT 1  [["discuss_id", 9], ["id", "9"]]