app/controllers/subjects_controller.rb

  def create
    @subject = @forum.subjects.new(forum_id: @forum)

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("created_at", "description", "forum_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 18 Sep 2013 14:50:59 UTC +00:00], ["description", "3423"], ["forum_id", 1], ["title", "2432"], ["updated_at", Wed, 18 Sep 2013 14:50:59 UTC +00:00]]

  def destroy
    @subject.destroy
---
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 4]]

    def set_subject
      @subject = @forum.subjects.find(params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."forum_id" = ? AND "subjects"."id" = ? LIMIT 1  [["forum_id", 1], ["id", "new1"]]

    def set_forum
      @forum = Forum.find(params[:forum_id])
---
SELECT "forums".* FROM "forums" WHERE "forums"."id" = ? ORDER BY "forums"."id" ASC LIMIT 1  [["id", 15]]