app/controllers/topics_controller.rb

INSERT INTO "topics" ("created_at", "description", "subject_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 18 Sep 2013 15:57:48 UTC +00:00], ["description", "dsf"], ["subject_id", 56], ["title", "sfd"], ["updated_at", Wed, 18 Sep 2013 15:57:48 UTC +00:00]]
---
  def create
       @topic = @subject.topics.new(topic_params)
       @topic.user = @user

    respond_to do |format|
      if @topic.save

DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 15]]
---
  def destroy
    @topic.destroy

SELECT "topics".* FROM "topics" WHERE "topics"."subject_id" = ? AND "topics"."id" = ? LIMIT 1  [["subject_id", 65], ["id", "15"]]
---
    def set_topic
      @topic = @subject.topics.friendly.find(params[:id])