app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if current_user && current_user.admin
          @users = User.all

UPDATE "users" SET "admin" = ?, "first_name" = ?, "last_name" = ?, "gender" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["admin", true], ["first_name", "Mike"], ["last_name", "Burkle"], ["gender", "male"], ["updated_at", Mon, 23 Sep 2013 16:49:50 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)